def area(a, b):
    """
    Возвращает площадь прямоугольника
        Параметры:
            a (float) - длина прямоугольника
            b (float) - ширина прямоугольника
        Возвращает значение:
            area (float) - плоащадь прямоугольника с заданными параметрами (a) и (b)
    """
    return a * b 

def perimeter(a, b):
    """
    Возвращает периметр прямоугольника
        Параметры:
            a (float) - длина прямоугольника
            b (float) - ширина прямоугольника
        Возвращает значение:
            perimeter (float) - периметр прямоугольника с заданными параметрами (a) и (b)
    """
    return (a+b) * 2 
