def area(a, h):
    """
    Возращает площадь треугольника
        Параметры:
            a (float) - основание треугольника
            h (float) - высота прямоугольника к основанию

        Возвращаем значение:
            area (float) - площадь треугольника с заданным параметром (a) и (h)
    """
    return a * h / 2 

def perimeter(a, b, c):
    """
    Возращает периметр треугольника
        Параметры:
            a (float) - первая сторона треугольника
            b (float) - вторая сторона треугольника
            c (float) - третья сторона треугольника

        Возвращаем значение:
            area (float) - периметр треугольника с заданным параметром (a), (b) и (c)
    """
    return a + b + c 
